HelloManagerSoa/_config.txt

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    	<soap:Body>
        		<ns1:findEmployeesView1IamManager xmlns:ns1="/model/common/types/">
            			<ns1:findCriteria xmlns:ns2="http://xmlns.oracle.com/adf/svc/types/">
                				<ns2:fetchStart></ns2:fetchStart>
                				<ns2:fetchSize></ns2:fetchSize>
                				<ns2:excludeAttribute></ns2:excludeAttribute>
            </ns1:findCriteria>
            			<ns1:OtherEmployee></ns1:OtherEmployee>
            			<ns1:Me></ns1:Me>
            			<ns1:findControl></ns1:findControl>
        </ns1:findEmployeesView1IamManager>
    </soap:Body>
</soap:Envelope>
